# Вариант 1
# Даны два целых числа А и В (А < В). Вывести в порядке возрастания все целые числа, расположеные между А и В (включая сами числа А и В), а так же количество N этих чисел.

# Безопасный ввод

while True:
    try:
        a = int(input("Введите целое число А: "))
        b = int(input("Введите целое число В (В >А):"))

        if a < b:
            break
        print("Ошибка, число А должно быть меньше числа В. Попробуйте снова.")
    except ValueError:
        print("Введите ЦЕЛОЕ ЧИСЛО: ")

count = 0
current = a