# Вариант 1
# Даны кооординаты точки, оне лужащий на координатах осях OX и OY.
# Определитьномер координатой четверти, в которой находится данная точка.

# Ввод координат точки

x = float(input("Введите координату х: "))
y = float(input("Введите координату у: "))

# Проверка условий для каждой четверти

if x > 0 and y > 0:
    quarter = 1
elif x < 0 and y > 0:
    quarter = 2
elif x < 0 and y < 0:
    quarter = 3
elif x > 0 and y < 0:
    quarter = 4
else:
    quarter = "Точка лежит на одной из осей координат"

# Вывод резульата на экран

print(f"Точка находится в {quarter}-й координатной четверти")