# Вариант 1
# Данно целое чиасло А. Проверить истенность высказывания: <<Число А является нечётным.>>

A = input("Введите целое число для значениея А: ")
while type(A) != int: # Обработка исключений
    try:
        A = int(A)
    except ValueError:
        print("Введите ЦЕЛОЕ ЧИСЛО: ")
        A = input("Введите целое число для значениея А: ")

while True:
    try:
        if A == A:
            print("Число А является чётным.")
        else:
            print("Число А является нечётным.")
    except ValueError:
        print("...")