# Вариант 1
# Известно, что Х кг конфет стоит А рублей. Определить, сколько стоит 1 кг и Y кг этих же конфет.

# Безопасный ввод веса Х

while True:
    try:
        x = float(input("Введите вес конфет Х (в кг): "))
        break # Если ввели число, цикл остановится
    except ValueError:
        print("Значение должно являться числом")

# Безопасный ввод стоимости А

while True:
    try:
        a = float(input("Введите стоимость этих конфет (в рублях): "))
        break
    except ValueError: # Значение, которое будет выведено на экран при ошибке ValueError
        print("Значение должно являться числом")

# Безопасный ввод веса Y

while True:
    try:
        y = float(input("Введите вес конфет Y (в кг): "))
        break
    except ValueError:
        print("Значение должно являться числом")

# Подсчёт ответа

cost_for_1_kg = a/x
cost_for_y_kg = cost_for_1_kg * y

# Вывод ответа на экран

print("Стоимость 1 кг конфет", cost_for_1_kg)
print("Стоимость Y кг конфет", cost_for_y_kg)